
Функция CatalogsGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.ВерсияДанных КАК ВерсияДанных,
	|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.Предопределенный КАК Предопределенный,
	|	Номенклатура.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	Номенклатура.Представление КАК Представление
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Ответ.УстановитьТелоИзСтроки(XMLСтрока(Новый ХранилищеЗначения(ТаблицаДанных, Новый СжатиеДанных(1))));
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	
	Возврат Ответ;
КонецФункции
